Revit 2026 API

# DocumentNewFootPrintRoof Method

---

Creates a new FootPrintRoof element.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FootPrintRoof NewFootPrintRoof(
	CurveArray footPrint,
	Level level,
	RoofType roofType,
	out ModelCurveArray footPrintToModelCurvesMapping
)
```
```vb
Public Function NewFootPrintRoof (
	footPrint As CurveArray,
	level As Level,
	roofType As RoofType,
	<OutAttribute> ByRef footPrintToModelCurvesMapping As ModelCurveArray
) As FootPrintRoof
```
```cpp
public:
FootPrintRoof^ NewFootPrintRoof(
	CurveArray^ footPrint,
	Level^ level,
	RoofType^ roofType,
	[OutAttribute] ModelCurveArray^% footPrintToModelCurvesMapping
)
```
```fsharp
member NewFootPrintRoof :
        footPrint : CurveArray *
        level : Level *
        roofType : RoofType *
        footPrintToModelCurvesMapping : ModelCurveArray byref -> FootPrintRoof
```

#### Parameters

footPrint CurveArray
    The footprint of the FootPrintRoof.
level Level
    The level of the FootPrintRoof.
roofType RoofType
    Type of the FootPrintRoof.
footPrintToModelCurvesMapping ModelCurveArray
    An array of Model Curves corresponding to the set of Curves input in the footPrint. By knowing which Model Curve was created by each footPrint curve, you can set properties like SlopeAngle for each curve.

#### Return Value

FootPrintRoof

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown if the level does not exist in the given document. |
| ArgumentException | Thrown if the roof type does not exist in the given document. |

This method will regenerate the document even in manual regeneration mode.

#### Reference

Document Class

Autodesk.Revit.Creation Namespace